CBF:128
python3 main.py --gpus=0 --dataset=CBF() --preset_files --ucr2018 --normalize_input --train --save --jitter --augmentation_ratio=4 --model=vgg
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 128, 1)]          0         
_________________________________________________________________
conv1d (Conv1D)              (None, 128, 64)           256       
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 128, 64)           12352     
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 64, 64)            0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 64, 128)           24704     
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 64, 128)           49280     
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 32, 128)           0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 32, 256)           98560     
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 32, 256)           196864    
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 32, 256)           196864    
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 16, 256)           0         
_________________________________________________________________
conv1d_7 (Conv1D)            (None, 16, 512)           393728    
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 16, 512)           786944    
_________________________________________________________________
conv1d_9 (Conv1D)            (None, 16, 512)           786944    
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 8, 512)            0         
_________________________________________________________________
flatten (Flatten)            (None, 4096)              0         
_________________________________________________________________
dense (Dense)                (None, 4096)              16781312  
_________________________________________________________________
dropout (Dropout)            (None, 4096)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 4096)              16781312  
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 12291     
=================================================================
Total params: 36,121,411
Trainable params: 36,121,411
Non-trainable params: 0

############################################################################################################################################
Rock:2844
python3 main.py --gpus=0 --dataset=Rock --preset_files --ucr2018 --normalize_input --train --save --jitter --augmentation_ratio=4 --model=vgg
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 2844, 1)]         0         
_________________________________________________________________
conv1d (Conv1D)              (None, 2844, 64)          256       
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 2844, 64)          12352     
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 1422, 64)          0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 1422, 128)         24704     
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 1422, 128)         49280     
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 711, 128)          0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 711, 256)          98560     
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 711, 256)          196864    
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 711, 256)          196864    
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 355, 256)          0         
_________________________________________________________________
conv1d_7 (Conv1D)            (None, 355, 512)          393728    
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 355, 512)          786944    
_________________________________________________________________
conv1d_9 (Conv1D)            (None, 355, 512)          786944    
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 177, 512)          0         
_________________________________________________________________
conv1d_10 (Conv1D)           (None, 177, 512)          786944    
_________________________________________________________________
conv1d_11 (Conv1D)           (None, 177, 512)          786944    
_________________________________________________________________
conv1d_12 (Conv1D)           (None, 177, 512)          786944    
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 88, 512)           0         
_________________________________________________________________
conv1d_13 (Conv1D)           (None, 88, 512)           786944    
_________________________________________________________________
conv1d_14 (Conv1D)           (None, 88, 512)           786944    
_________________________________________________________________
conv1d_15 (Conv1D)           (None, 88, 512)           786944    
_________________________________________________________________
max_pooling1d_5 (MaxPooling1 (None, 44, 512)           0         
_________________________________________________________________
conv1d_16 (Conv1D)           (None, 44, 512)           786944    
_________________________________________________________________
conv1d_17 (Conv1D)           (None, 44, 512)           786944    
_________________________________________________________________
conv1d_18 (Conv1D)           (None, 44, 512)           786944    
_________________________________________________________________
max_pooling1d_6 (MaxPooling1 (None, 22, 512)           0         
_________________________________________________________________
conv1d_19 (Conv1D)           (None, 22, 512)           786944    
_________________________________________________________________
conv1d_20 (Conv1D)           (None, 22, 512)           786944    
_________________________________________________________________
conv1d_21 (Conv1D)           (None, 22, 512)           786944    
_________________________________________________________________
max_pooling1d_7 (MaxPooling1 (None, 11, 512)           0         
_________________________________________________________________
flatten (Flatten)            (None, 5632)              0         
_________________________________________________________________
dense (Dense)                (None, 4096)              23072768  
_________________________________________________________________
dropout (Dropout)            (None, 4096)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 4096)              16781312  
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 4)                 16388     
=================================================================
Total params: 51,860,292
Trainable params: 51,860,292
Non-trainable params: 0

############################################################################################################################################
CricketX:300
python3 main.py --gpus=0 --dataset=CricketX --preset_files --ucr2018 --normalize_input --train --save --jitter --augmentation_ratio=4 --model=vgg
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 300, 1)]          0         
_________________________________________________________________
conv1d (Conv1D)              (None, 300, 64)           256       
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 300, 64)           12352     
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 150, 64)           0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 150, 128)          24704     
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 150, 128)          49280     
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 75, 128)           0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 75, 256)           98560     
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 75, 256)           196864    
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 75, 256)           196864    
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 37, 256)           0         
_________________________________________________________________
conv1d_7 (Conv1D)            (None, 37, 512)           393728    
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 37, 512)           786944    
_________________________________________________________________
conv1d_9 (Conv1D)            (None, 37, 512)           786944    
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 18, 512)           0         
_________________________________________________________________
conv1d_10 (Conv1D)           (None, 18, 512)           786944    
_________________________________________________________________
conv1d_11 (Conv1D)           (None, 18, 512)           786944    
_________________________________________________________________
conv1d_12 (Conv1D)           (None, 18, 512)           786944    
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 9, 512)            0         
_________________________________________________________________
flatten (Flatten)            (None, 4608)              0         
_________________________________________________________________
dense (Dense)                (None, 4096)              18878464  
_________________________________________________________________
dropout (Dropout)            (None, 4096)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 4096)              16781312  
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 12)                49164     
=================================================================
Total params: 40,616,268
Trainable params: 40,616,268
Non-trainable params: 0


############################################################################################################################################
Plane:144
python3 main.py --gpus=0 --dataset=Plane --preset_files --ucr2018 --normalize_input --train --save --jitter --augmentation_ratio=4 --model=vgg
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 144, 1)]          0         
_________________________________________________________________
conv1d (Conv1D)              (None, 144, 64)           256       
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 144, 64)           12352     
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 72, 64)            0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 72, 128)           24704     
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 72, 128)           49280     
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 36, 128)           0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 36, 256)           98560     
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 36, 256)           196864    
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 36, 256)           196864    
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 18, 256)           0         
_________________________________________________________________
conv1d_7 (Conv1D)            (None, 18, 512)           393728    
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 18, 512)           786944    
_________________________________________________________________
conv1d_9 (Conv1D)            (None, 18, 512)           786944    
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 9, 512)            0         
_________________________________________________________________
flatten (Flatten)            (None, 4608)              0         
_________________________________________________________________
dense (Dense)                (None, 4096)              18878464  
_________________________________________________________________
dropout (Dropout)            (None, 4096)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 4096)              16781312  
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 7)                 28679     
=================================================================
Total params: 38,234,951
Trainable params: 38,234,951
Non-trainable params: 0

############################################################################################################################################
Adiac:176
python3 main.py --gpus=0 --dataset=Adiac --preset_files --ucr2018 --normalize_input --train --save --jitter --augmentation_ratio=4 --model=vgg
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 176, 1)]          0         
_________________________________________________________________
conv1d (Conv1D)              (None, 176, 64)           256       
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 176, 64)           12352     
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 88, 64)            0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 88, 128)           24704     
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 88, 128)           49280     
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 44, 128)           0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 44, 256)           98560     
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 44, 256)           196864    
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 44, 256)           196864    
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 22, 256)           0         
_________________________________________________________________
conv1d_7 (Conv1D)            (None, 22, 512)           393728    
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 22, 512)           786944    
_________________________________________________________________
conv1d_9 (Conv1D)            (None, 22, 512)           786944    
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 11, 512)           0         
_________________________________________________________________
flatten (Flatten)            (None, 5632)              0         
_________________________________________________________________
dense (Dense)                (None, 4096)              23072768  
_________________________________________________________________
dropout (Dropout)            (None, 4096)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 4096)              16781312  
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 37)                151589    
=================================================================
Total params: 42,552,165
Trainable params: 42,552,165
Non-trainable params: 0

